const translate = require("google-translate-api");
var sys = require("sys");
var exec = require("child_process").exec;
var overall_score = 0.0;
//2 2.513
var msg =
  'கரு : சினிமா படப்பிடிப்புகளில் வெளிச்சம் பாய்ச்சும் லைட்மேன் எனும் கடைநிலை ஊழியர்களின் அவல நிலை குறித்து பேசியிருக்கிறது இப்படக் கரு.<NEWLINE>கதை : கிராமத்து இளம் கூத்துக்கலைஞர் குணா எனும் கார்த்திக் நாகராஜன், சினிமா நாயகர் ஆசையில் தன் காதல் மனைவி சித்ரா எனும் ஜெனிபரை கூட்டிக் கொண்டு கோடம்பாக்கம் வந்து ஏறாத படக்கம்பெனிகள் இல்லை. இறங்காத சினிமா தயாரிப்பு நிறுவனங்கள் இல்லை. எனும் அளவிற்கு ஏறி, இறங்கி நடிக்க வாய்ப்பு தேடுகிறார். எதுவும கிடைக்காத சூழலில், வயிற்றுக்காகவும், இளம் மனைவியுடனான வாழ்க்கைக்காகவும் சினிமா லைட்மேனாக களம் இறங்குகிறார்.<NEWLINE>படுகடுமையான அத்தொழிலில் போதிய வருமானமும் இல்லாது கடும் அசதியும் உடல் வலியும் ஏற்பட., குடிப்பழக்கத்திற்கு அடிமையாகும் குணா, அதிலிருந்து மீண்டாரா? அவர் லட்சியத்தை அடைந்தாரா? எனும் கதையோடும், காட்சியமைப்புகளோடும் இவரைப் போன்று சினிமாவில் சாதிக்கும் லட்சியத்தோடு அடியெடுத்து வைத்து., லைட்மேன்களாக போதிய வருமானமின்றி அவதிப்படும் சில நிஜங்களையும் படம் பிடித்து காட்ட முயன்றிருக்கிறது லைட்மேன் படத்தின் கதை மொத்தமும்!<NEWLINE>காட்சிப்படுத்தல் : வெங்கடேஷ் குமார் .ஜி யின் எழுத்து, இயக்கம் மற்றும் தயாரிப்பில் புதுமுகங்கள் கார்த்திக் நாகராஜன் - ஜெனிபர் ஜோடி யாக நடிக்க சினிமாவிற்கு ஒளி வெள்ளம் பாய்ச்சும் தொழிலாளர்களின் வாழ்க்கை இருள் அவலம் பற்றி வெளி உலகிற்கு எடுத்துரைக்க வந்திருக்கும் "லைட்மேன்" திரைப்படத்தில் பெரும் பகுதி காட்சிகள் டாக்குமெண்டரி ஸ்டைலில் படமாக்கப்பட்டுள்ளது ரசிகனை சோர்வடைய வைப்பது பலவீனம்!<NEWLINE>கதாநாயகர் : கிராமத்து இளம் கூத்துக் கலைஞராகவும் , சினிமா லைட்மேனாகவும் லட்சியம் நிறைவேறா இளைஞர் குணாவாக கார்த்திக் நாகராஜன் \'நச்\' சென்று நடித்திருக்கிறார்.<NEWLINE>கதாநாயகி : நாயகர் குணாவின் இளம் மனைவியாக அவரோடு சேர்ந்து அல்லல்படும், அவதிப்படும் நாயகியாக சித்ராவாக ஜெனிபர் இயல்பாக இருப்பதும் நடித்திருப்பதும் ஆறுதல்.<NEWLINE>பிற நட்சத்திரங்கள் : கதிராக வரும் வாசகன் , தங்கராஜாக வரும் கோவிந்த ஸ்வாமிநாதன் உள்ளிட்டோரும் லைட்மேன்களின் கஷ்ட , நஷ்ட வாழ்க்கையை ஒரு மாதிரி உணர்ச்சிகரமாக தங்கள் நடிப்பில் காட்ட முயற்சிக்காமல் சொல்லி காட்ட முற்பட்டிருப்பது., தியேட்டரில் டிராஜிடிக்கு பதில் காமெடியாகி விடுகிறது! பாவம்!<NEWLINE>தொழில்நுட்பகலைஞர்கள் : கமலின் படத்தொகுப்பில் முன் பாதி கமர்ஷியலாகவும் பின் பாதி முழுக்க முழுக்க டாக்குமெண்டரி டைப்பிலும் எடிட் செய்யப்பட்டிருப்பது குறை. ராகுலின் ஒளிப்பதிவு, சினிமாவுக்கு ஒளி வெள்ளம் பாய்ச்சும் லைட்மேன்களின்<NEWLINE>வாழ்க்கையில் ஒளியேற்றும் படி பெரிதாக செயல்படவில்லை.... என்பது வருத்தம். டோனி பிரிட்டோவின் இசையும், பின்னணி இசையும் பெரிதாக சொல்லிக் கொள்ளும்படி இல்லாதது மைனஸ்.<NEWLINE>பலம் : நாயகன், நாயகி இருவரது நடிப்பிலும், இல்லாமையும் , இயலாமையும்., ஏழ்மையும், ஏமாற்றமும் அழகாக வெளிப்பட்டிருப்பது இப்பட கதைக்கும் காட்சியமைப்புகளுக்கும் கொஞ்சம் வலு சேர்த்திருக்கிறது. "விட்டில் பூச்சின்னு ஒன்று இருக்கு அது விளக்கு வெளிச்சத்தை தேடி ஓடும்... கிட்டப் போனதும் சூடு தாங்காது செத்துடும்... அப்படித்தான் நானும் போல... "குணா, நாம சினிமாவை நேசிக்கறோம் சினிமா நம்மளை நேசிக்கலையே... \' சினிமா நம்மை நேசிக்கல்லாம் வேண்டாம். சினிமா நம்மளை திரும்பி பார்த்தாலே போதும்...." ஆகிய யதார்த்த வசனங்கள் இப்படத்திற்கு<NEWLINE>கூடுதல் பலம்.<NEWLINE>பலவீனம் : சினிமாவுக்கு வெளிச்சம் பாய்ச்சும் லைட்மேன்களின் கஷ்ட, நஷ்டம் பேசும் இப்பட ஒளிப்பதிவும், இசையும், பின்னணி இசையும் ... பட்ஜெட் பற்றாக்குறையினாலோ , என்னவோ ... சொல்லிக் கொள்ளும்படியாக இல்லாதது பெரும்பலவீனம்.<NEWLINE>இயக்கம் :வெங்கடேஷ் குமார்.ஜியின் எழுத்து இயக்கம் மற்றும் தயாரிப்பில்.,"பழச பேசுறது சந்தோஷமா இருக்கும் ஆனா நிஜம் தான் நிதர்சனம்..." உள்ளிட்ட வசனங்கள் "நச் - டச் " . என்றாலும்., சினிமா வரலாற்றில் வெளிச்சம் பாய்ச்சும் லைட்மேன்கள் வாழ்க்கையை பிரதிபலிக்கும் முதல் திரைப்படமாக வந்திருக்கும் இத்திரைப்படம்., சற்றே டாக்குமென்டரியாக இருப்பது சாதாரண, சாமான்ய ரசிகர்களை சந்தோஷப்படுத்துமா? என்பது சந்தேகமே !<NEWLINE>பைனல்" பன்ச் " : ஆகவே "லைட்மேன் \' ரொம்பவும் \'ஹெவிவெயிட் மற்றும் \'ஹெவி டோஸ்\' என்பது குறையே.';

var splitted = msg.split(".");
//var length = splitted.length-1;
var length = 20;
for (let i = 0; i < length; i++) {
  translate(splitted[i], { to: "en" })
    .then(res => {
      console.log(res.text);
      cmd = 'python3 sentiment.py "' + res.text + '"';
      console.log(cmd);
      dir = exec(cmd, function(err, stdout, stderr) {
        if (err) {
          // should have err.code here?
        }
        console.log(stdout);

        let parsedOut = parseFloat(stdout);
        if (parsedOut != NaN) {
          overall_score += parsedOut;
        }
        if (i == length - 1) {
          let score = ((overall_score / length + 1) / 2) * 5;

          console.log("Score:", score);
        }
      });

      dir.on("exit", function(code) {
        // exit code is code
      });
    })
    .catch(err => {
      console.error("Error:", i, splitted[i], err);
    });
}
